app/controllers/tasks_controller.rb

  def index
    @tasks = Task.order(due_date: :asc)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."due_date" ASC

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("title", "memo", "due_date", "completed", "created_at", "updated_at") VALUES ('ご飯', 'ぎゅーどんがいいな', '2025-04-22', FALSE, '2025-04-20 12:21:40.827065', '2025-04-20 12:21:40.827065') RETURNING "id"